#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
data.azurerm_resource_group.rg: Reading...
data.azurerm_resource_group.rg: Read complete after 0s [id=/subscriptions/b4b2e7e9-66e7-46b5-a56b-cce2b50011d4/resourceGroups/rg-tfdemo-australiaeast]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_application_insights.appinsights will be created
  + resource "azurerm_application_insights" "appinsights" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "australiaeast"
      + name                                = "appi-tfdemo-australiaeast"
      + resource_group_name                 = "rg-tfdemo-australiaeast"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + workspace_id                        = (known after apply)
    }

  # azurerm_linux_web_app.app will be created
  + resource "azurerm_linux_web_app" "app" {
      + app_settings                                   = (known after apply)
      + client_affinity_enabled                        = false
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Required"
      + custom_domain_verification_id                  = (sensitive value)
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = true
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "australiaeast"
      + name                                           = "app-tfdemo-australiaeast"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "rg-tfdemo-australiaeast"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + connection_string {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + site_config {
          + always_on                               = false
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + ftps_state                              = "Disabled"
          + http2_enabled                           = true
          + ip_restriction_default_action           = "Allow"
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + local_mysql_enabled                     = false
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_ip_restriction_default_action       = "Allow"
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = true
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + dotnet_version = "6.0"
            }
        }
    }

  # azurerm_log_analytics_workspace.la will be created
  + resource "azurerm_log_analytics_workspace" "la" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "australiaeast"
      + name                            = "log-tfdemo-australiaeast"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rg-tfdemo-australiaeast"
      + retention_in_days               = (known after apply)
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_mssql_database.database will be created
  + resource "azurerm_mssql_database" "database" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = "SQL_Latin1_General_CP1_CI_AS"
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = 1
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-tfdemo-australiaeast"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = false

      + long_term_retention_policy (known after apply)

      + short_term_retention_policy (known after apply)

      + threat_detection_policy (known after apply)
    }

  # azurerm_mssql_firewall_rule.azure_services will be created
  + resource "azurerm_mssql_firewall_rule" "azure_services" {
      + end_ip_address   = "0.0.0.0"
      + id               = (known after apply)
      + name             = "AllowAllWindowsAzureIps"
      + server_id        = (known after apply)
      + start_ip_address = "0.0.0.0"
    }

  # azurerm_mssql_server.mssql will be created
  + resource "azurerm_mssql_server" "mssql" {
      + administrator_login                  = "sqladmin"
      + administrator_login_password         = (sensitive value)
      + connection_policy                    = "Default"
      + fully_qualified_domain_name          = (known after apply)
      + id                                   = (known after apply)
      + location                             = "australiaeast"
      + minimum_tls_version                  = "1.2"
      + name                                 = "sql-tfdemo-australiaeast"
      + outbound_network_restriction_enabled = false
      + primary_user_assigned_identity_id    = (known after apply)
      + public_network_access_enabled        = true
      + resource_group_name                  = "rg-tfdemo-australiaeast"
      + restorable_dropped_database_ids      = (known after apply)
      + version                              = "12.0"

      + azuread_administrator {
          + azuread_authentication_only = (known after apply)
          + login_username              = "AzureAD Admin"
          + object_id                   = "9f9b3ec2-42af-456e-be88-d1b22d86e96b"
          + tenant_id                   = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }
    }

  # azurerm_service_plan.plan will be created
  + resource "azurerm_service_plan" "plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "australiaeast"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "plan-tfdemo-australiaeast"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "rg-tfdemo-australiaeast"
      + sku_name                     = "F1"
      + worker_count                 = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @flcdrg, Action: `pull_request`*